/**
 * Необходимо найти в упорядоченном по возрастанию массиве любую пару чисел, сумма которых наиболее близка заданной. Сумма должна быть минимальной
 * @param {number} amount - Заданная сумма, для которой надо найти приближенное значение
 * @param {Array} items - Упорядоченный по возрастанию массив чисел
 * @returns {number | null} - Минимальная сумма двух чисел, наиболее близкая к amount(или null, если длина массива меньше 2)
 */
function getNearestAmount(amount, items) {}

module.exports = getNearestAmount;
